{"unit_id": "20250115082::claim::17", "doc_number": "20250115082", "title": "WHEEL PARTITION ASSEMBLY CONFIGURED TO MODIFY TIRE CAVITY RESONANCE", "classification": "B60C1900FI", "section": "claim", "idx": 17, "text": "a wheel including a rim; a tire mounted to the wheel to define a tire cavity between the wheel and the tire; a partition assembly mounted to the wheel in the tire cavity, the partition assembly including: an air line extending around the wheel, the air line in cooperation with a valve configured to couple with an air source for introducing air from the air source into the air line; and a plurality of baffles mounted to the wheel and connected to the air line to receive air from the air line, each one of the plurality of baffles is expandable from a deflated configuration to an inflated configuration in response to air from the air line flowing into the plurality of baffles, in the inflated configuration the plurality of baffles contact an inner wall of the tire to divide the tire cavity into a plurality of air-tight segments; wherein each one of the plurality of baffles includes: an expandable body in fluid communication with the air line to receive air from the air line for inflating the expandable body; and a seal extending about an outer perimeter of the expandable body, the seal is in fluid communication with the air line to receive air from the air line for inflating the seal.", "abstract": "A partition assembly configured to be mounted in a tire cavity defined between a wheel and a tire to divide the tire cavity into a plurality of segments, the partition assembly including at least one air line and a plurality of baffles. Each one of the plurality of baffles including: a base configured to be mounted to the wheel, the base defining an air passageway in fluid communication with the at least one air line; and an expandable body connected to the base and in fluid communication with the air passageway of the base, the expandable body configured to be filled with air from the at least one air line. Each one of the plurality of baffles is configured to receive air from the at least one air line to expand the plurality of baffles from a deflated configuration to an inflated configuration in which the plurality of baffles are configured to contact an inner wall of the tire coupled to the wheel to divide the tire cavity into the plurality of segments.", "source_file": "patents_ipa250410.json"}
{"unit_id": "20240408915::desc::68", "doc_number": "20240408915", "title": "PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES", "classification": "B60C1103FI", "section": "desc", "idx": 68, "text": "To address this, first, in the tire according to the present embodiment, the ratio LCR/TW is greater than 0.045. This results in a tire that has a relatively round crown shape, and therefore a rounded ground contact area, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area.", "abstract": "A pneumatic radial tire for passenger vehicles that satisfies a defined relationship between sectional width SW and outer diameter OD of the tire, and includes only one circumferential main groove extending in a tire circumferential direction on a tread contact surface, the circumferential main groove being provided to a half portion of the tire on a vehicle-mounted outward side, which is one side of the tire in a tread width direction with a tire equatorial plane as a boundary. A drop height (or ground contact length relationship, or tread gauge relationship) is also defined.", "source_file": "patents_ipa241212.json"}
{"unit_id": "20250033406::desc::8", "doc_number": "20250033406", "title": "APERTURED ARTICLE, INSERTION ARTICLE AND ASSOCIATED SYSTEMS", "classification": "B60B310FI", "section": "desc", "idx": 8, "text": "The aperture inner periphery0106is positioned along the circumference of an inner aperture reference circle0110, the inner aperture reference circle0110inscribing the aperture periphery0104, and the aperture outer periphery0112is positioned along the circumference of an outer aperture reference circle0114.", "abstract": "An apertured article, insertion article and associated systems. The apertured article having an aperture, which has an aperture periphery, the aperture periphery having an aperture inner periphery and spaced aperture protrusions that extend radially outwardly from the aperture inner periphery to an aperture outer periphery. The aperture outer periphery is defined by distal edges of the spaced aperture protrusions. The aperture inner periphery is positioned along the circumference of an inner aperture reference circle, the inner aperture reference circle inscribing the aperture periphery, and the aperture outer periphery is positioned along the circumference of an outer aperture reference circle. As viewed along a radial line whose origin is at the center of the inner aperture reference circle, the aperture inner periphery can be positioned along 0.4 to 0.6 of the entire circumference of the inner aperture reference circle. The insertion article can be configured for insertion in the apertured article.", "source_file": "patents_ipa250130.json"}
{"unit_id": "20240059100::desc::154", "doc_number": "20240059100", "title": "COMPOSITIONS FOR ELASTOMERIC COMPOUNDS AND TYRES FOR VEHICLES COMPRISING REVERSIBLE CROSS-LINKING AGENT", "classification": "B60C100FI", "section": "desc", "idx": 154, "text": "The elastomeric composition according to the invention may furthermore comprise possible other salts which are not however capable of forming complexes with the multidentate organic C ligand of the reversible cross-linking agent of formula (I), such as for example zinc stearate and zinc octoate.", "abstract": "The present invention relates to compositions for elastomeric compounds for tyres, in particular for tyre treads, comprising particular reversible cross-linking agents, tyre components and tyres for vehicle wheels which comprise them. The present elastomeric compounds, due to their particular hysteretic behaviour, allow manufacturing tyres characterised by a lower rolling resistance during moderate driving and at the same time greater resistance to tearing and road grip during sports driving.", "source_file": "patents_ipa240222.json"}
{"unit_id": "20240399787::claim::1", "doc_number": "20240399787", "title": "V-SHAPED WHEEL SPOKE", "classification": "B60B102FI", "section": "claim", "idx": 1, "text": "2 . The V-shaped wheel spoke according to claim 1 , wherein the first through hole at the bottom part of the V-shaped wheel spoke has a diameter of 5 mm, and the second through hole at the top portion of the two legs of the V-shaped wheel spoke has a diameter of 6 mm.", "abstract": "A V-shaped wheel spoke made of carbon fiber material is provided. The bottom part of the spoke is provided with a first through hole for placing a bolt when the spoke is connected with a wheel rim. The spoke has two legs, the top portion of each of the two legs is provided with a second through hole for placing bolt when the two legs are connected with flanges at left and right sides of a hub. With this design, the conventional connection structure consisting of spokes and nipples has been abandoned, and bolts or fastening structures are used for connection. The two legs of the spoke are respectively connected to the flanges at the left and right sides of the hub with bolts or fastening structures, such that the overall structure forms a stable triangle which greatly improves the strength and stiffness of the wheel.", "source_file": "patents_ipa241205.json"}
{"unit_id": "20240217264::desc::44", "doc_number": "20240217264", "title": "SYSTEMS AND METHODS FOR PRELOADING A BEARING AND ALIGNING A LOCK NUT", "classification": "B60B2700FI", "section": "desc", "idx": 44, "text": "Wrench230may include multiple wrench extension arms240(e.g.,2wrench extension arms240) as depicted in the figures and each of such arms may include teeth235at a distal end239of each of arms240opposite base236such that teeth235may engage teeth511when wrench230is extended to contact nut11as depicted in aFIG.7, for example. Teeth238may extend radially outwardly relative to a remainder of arms240to allow engagement of teeth235with teeth511. Wrench extension arms240may be configured (e.g., shaped and dimensioned) such that the arms may extend toward nut11to engage teeth511as described without arms240extending radially outwardly past aligning arm205or extensions212,213. Nut11may be surrounded by hub assembly12, as in a drive axle, such that it would not be possible to utilize a conventional wrench having inside flat portions to engage outside flat surfaces or sidewalls523of the nut. The engagement of teeth235of wrench arms240with teeth511of nut11thus allows a user to tighten and loosen nut11without accessing outer sidewalls of nut11. Thus, the use of wrench230allows a user to selectively rotate nut11without accessing outside surfaces of nut11when nut11may be surrounded by a hub assembly or other barrier as in a steer axle.", "abstract": "A system for use in providing a load on a bearing mounted to a shaft includes a preload apparatus having a first extension and a second extension engageable with an inner race of the bearing and configured to provide a compressive load to the bearing. The first extension has a first projection and the second extension has a second projection. A stop ring is configured to limit a radially inward movement of the first extension and the second extension toward each other to position the first projection and the second projection relative to the bearing.", "source_file": "patents_ipa240704.json"}
{"unit_id": "20240181807::desc::32", "doc_number": "20240181807", "title": "BICYCLE DRIVE ASSEMBLY", "classification": "B60B2704FI", "section": "desc", "idx": 32, "text": "Front derailer38selectively connects gear chain34to a selected one of the different cog wheels or sprockets of front cog wheels32. Front derailer38shifts gear chain34from one cog wheel or sprocket to another cog wheel or sprocket of front cog wheel32. Front derailer38may be actuated by the rider.", "abstract": "A bicycle drive assembly may include an axle, a hub shell rotatably mounted on the axle by a first bearing, a free hub rotatably mounted on the axle by a second bearing, and a ratchet mechanism releasably coupling the free hub to the hub shell to transmit torque from the free hub to the hub. The ratchet mechanism may include a first ratchet ring having an inner surface joined to the hub shell for rotation with the hub shell and a second ratchet ring having an inner surface joined to the free hub for rotation with the free hub. The first ratchet ring and the second ratchet ring encircle and radially overlap the first bearing and the second bearing, respectively. At least one spring resiliently biases the first ratchet face and the second ratchet face into engagement to transmit torque from the free hub to the hub shell.", "source_file": "patents_ipa240606.json"}
{"unit_id": "20250065669::desc::98", "doc_number": "20250065669", "title": "SYSTEMS AND METHODS FOR PROVIDING WHEELS HAVING VARIABLE SPRING RATES", "classification": "B60B904FI", "section": "desc", "idx": 98, "text": "Those skilled in the art will appreciate that numerous variations and modifications may be made to the above disclosed embodiments without departing from the spirit and scope of the present invention.", "abstract": "A wheel is disclosed that includes an inner hub, an outer rim, and a plurality of resilient elements that exhibit a first spring constant that is the same for all elements, and a second spring constant that is higher than the first spring constant for elements being compressed beyond a threshold deflection.", "source_file": "patents_ipa250227.json"}
{"unit_id": "20240262133::desc::94", "doc_number": "20240262133", "title": "PNEUMATIC TIRE", "classification": "B60C1103FI", "section": "desc", "idx": 94, "text": "Hereinafter, the center blocks40and50and the shoulder blocks60and70that constitute the tread10will be explained in more detail with reference toFIG.2.", "abstract": "A pneumatic tire that is mounted on a vehicle in a specified direction and includes a tread rubber on a tread. The tread rubber has a plurality of main grooves extending along a tire circumferential direction, a pair of shoulder blocks that are defined by the main grooves and arranged on outer sides in a tire axial direction, and center blocks located between the pair of shoulder blocks. The center blocks are ribbed blocks that are continuous in the tire circumferential direction, and the tread rubber has a storage modulus at −25° C. (−25° C. E′) of 60 MPa or more and 150 MPa or less.", "source_file": "patents_ipa240808.json"}
{"unit_id": "20240190169::desc::40", "doc_number": "20240190169", "title": "Wheel for a Chassis of a Rail Vehicle, Chassis for Rail Vehicles and Method for Producing the Wheel for the Chassis of the Rail Vehicle", "classification": "B60B1700FI", "section": "desc", "idx": 40, "text": "The second recess10, the third recess11and the fourth recess12are formed identically to the first recess9and are positioned radially identically to the first recess9in the wheel web1, but in the circumferential direction have different positions than the first recess9.", "abstract": "A forged wheel for a chassis of a rail vehicle includes a wheel web, a wheel hub and a wheel rim with a running surface and a wheel flange, where material is recessed out of the wheel web, which is solid in sections, between the wheel hub and the wheel rim, in sections extending in the circumferential direction or transversely with respect to a radial direction of the wheel web, and where at least a first distance and a second distance between a recess centre point of a first recess in the wheel web and an edge of the first recess differ in size such that a lightweight wheel that can be manufactured with little outlay and that has high strength and quality is obtained.", "source_file": "patents_ipa240613.json"}
{"unit_id": "20240109373::desc::60", "doc_number": "20240109373", "title": "PNEUMATIC TIRE", "classification": "B60C1103FI", "section": "desc", "idx": 60, "text": "The polygonal shapes formed by the respective first center blocks211on the tread surface1may be congruent or substantially congruent. Similarly, the polygonal shapes formed by the respective second center blocks212on the tread surface1may be congruent or substantially congruent.", "abstract": "A pneumatic tire that includes a tread surface 1 including: two or more main grooves 3 ; and a pair of middle block rows 22 , wherein one or more first middle blocks in the plurality of middle blocks each have a middle block inclined side wall surface 223 that faces an outer main groove in the pair of outer main grooves and that gradually inclines inwards in a tire radial direction as the middle block inclined side wall surface extends outwards in the tire width direction, and the middle block inclined side wall surface forms an acute angle θ 223 of 30° to 50° with respect to a normal of the tread surface at an inner end in the tire width direction of the middle block inclined side wall surface.", "source_file": "patents_ipa240404.json"}
{"unit_id": "20250074114::claim::5", "doc_number": "20250074114", "title": "BICYCLE HUB SYSTEM, METHOD AND DEVICE INCLUDING A REAR HUB LOCKING MECHANISM", "classification": "B60B2702FI", "section": "claim", "idx": 5, "text": "35 . The bicycle system of claim 34 , wherein the ratchet mechanism further comprises a plurality of bearings positioned within the ratchet housing around the stem of the axle.", "abstract": "A bicycle hub system, method and device including rear and front hub assemblies. Both the rear and front hub assemblies include locking mechanisms with matching undulating splined coupling faces that correspond to complementary undulating splined coupling faces of a wheel hub.", "source_file": "patents_ipa250306.json"}
{"unit_id": "20240181808::desc::46", "doc_number": "20240181808", "title": "BICYCLE DRIVE ASSEMBLY", "classification": "B60B2704FI", "section": "desc", "idx": 46, "text": "Hub212comprises hub shell218with spokes flanges220, hub bearing308and hub bearing310. Hub shell218comprises a generally hollow cylindrical structure formed from a metal, such as aluminum. Hub shell218connects to spokes224and supports rim228of wheel26. As shown byFIG.5, hub shell218comprises an axial through opening316through which axle shaft302extends. Hub shell218comprises an internal groove317that receives a snap ring318which is sized and located to axially retain bearing332about and along axle shaft302. In other implementations, ring318may be replaced with a shoulder integrally formed as part of hub shell218.", "abstract": "A bicycle drive assembly may include an axle, a hub shell rotatably mounted on the axle by a first bearing, a free hub rotatably mounted on the axle by a second bearing, and a ratchet mechanism releasably coupling the free hub to the hub shell to transmit torque from the free hub to the hub. The ratchet mechanism may include a first ratchet ring having an inner surface joined to the hub shell for rotation with the hub shell and a second ratchet ring having an inner surface joined to the free hub for rotation with the free hub. The first ratchet ring and the second ratchet ring encircle and radially overlap the first bearing and the second bearing, respectively. At least one spring resiliently biases the first ratchet face and the second ratchet face into engagement to transmit torque from the free hub to the hub shell.", "source_file": "patents_ipa240606.json"}
{"unit_id": "20250065668::desc::4", "doc_number": "20250065668", "title": "DECORATIVE SECURITY WHEEL FASTENER", "classification": "B60B316FI", "section": "desc", "idx": 4, "text": "Available security fasteners may not have matching styling, size, form, or fit of existing wheel fasteners. Available security fasteners also may not meet tension and friction requirements of existing wheel fasteners.", "abstract": "A security fastener assembly is provided with a cap having a decorative bearing surface and a lower retention portion. A fastener body has: a threaded portion or securing the fastener assembly to a corresponding threaded feature on a vehicle; a stem opposite the threaded portion for receiving the cap, the stem having a security protrusion defining a distal end, an undercut formed adjacent the stem for cooperating with the lower retention portion of the cap, where the lower retention portion of the cap is secured in the undercut to maintain the cap on the fastener body; a keyed security drive feature formed between the threaded portion the stem portion where the fastener body is removable with the keyed security feature. Engaging the decorative bearing surface of the cap and rotating does not rotate the threaded portion of the fastener body.", "source_file": "patents_ipa250227.json"}
{"unit_id": "20250091382::claim::14", "doc_number": "20250091382", "title": "WHEEL ASSEMBLY INCLUDING FASTENER COUPLED RIGID COVER RING AND RELATED METHODS", "classification": "B60B918FI", "section": "claim", "idx": 14, "text": "operatively coupling a plurality of gas springs between an inner rim and an outer rim surrounding the inner rim to permit relative movement therebetween; mounting a rigid inboard cover ring to an inboard side of the outer rim and extending radially inward toward the inner rim; coupling the rigid inboard cover ring to the inboard side of the outer rim with a plurality of fasteners, each of the plurality of fasteners comprising a threaded fastener head and a threaded shaft extending therefrom; and mounting a flexible inboard seal between the rigid inboard cover ring and the inner rim.", "abstract": "A wheel assembly may include an inner rim to be coupled to the hub of the vehicle, and an outer rim surrounding the inner rim. The wheel assembly may also include gas springs operatively coupled between the inner rim and the outer rim and permitting relative movement therebetween. The wheel assembly may also include a rigid inboard cover ring coupled to an inboard side of the outer rim and extending radially inward toward the inner rim, and fasteners coupling the rigid inboard cover ring to the inboard side of the outer rim. Each fastener may include a threaded fastener head and a threaded shaft extending therefrom. A flexible inboard seal may be coupled between the rigid inboard cover ring and the inner rim.", "source_file": "patents_ipa250320.json"}
{"unit_id": "20250074112::claim::5", "doc_number": "20250074112", "title": "BICYCLE HUB SYSTEM, METHOD AND DEVICE INCLUDING A FRONT HUB LOCKING MECHANISM", "classification": "B60B2702FI", "section": "claim", "idx": 5, "text": "6 . The bicycle front hub system of claim 1 , wherein the hub comprises a tube coupled between a pair of flanges, wherein each of the flanges includes an outer flange face having a central flange aperture and hub splines.", "abstract": "A bicycle hub system, method and device including rear and front hub assemblies. Both the rear and front hub assemblies include locking mechanisms with matching undulating splined coupling faces that correspond to complementary undulating splined coupling faces of a wheel hub.", "source_file": "patents_ipa250306.json"}
{"unit_id": "20240294036::claim::15", "doc_number": "20240294036", "title": "VEHICLE WHEEL COVER CASING AND A METHOD OF MANUFACTURING A VEHICLE WHEEL COVER CASING", "classification": "B60B1500FI", "section": "claim", "idx": 15, "text": "49 . The sleeve for covering vehicle wheels according to claim 48 , wherein the metal yarns are totally or partially made of titanium.", "abstract": "A sleeve for covering vehicle wheels includes a fabric band having an annular arrangement and therefore with a circumferential path as a result of the annular geometry, the band having such proportions and being enabled to cover and surround an external region of a wheel of a vehicle. The fabric band has a central area along its circumferential path and at least one lateral area adjacent to the central area following the same circumferential path. The at least one adjacent lateral area of the band has a surface density value lower than the surface density value of the central area of the same band. The band also presents a textile or fabric continuity in the mutual contact between its central area and at least one adjacent lateral area, the band being formed in one piece or textile body.", "source_file": "patents_ipa240905.json"}
{"unit_id": "20250058589::claim::4", "doc_number": "20250058589", "title": "Tire Having a Compromise in Terms of Performance Between Grip on Snow and Running Noise", "classification": "B60C1103FI", "section": "claim", "idx": 4, "text": "5 . The tire according to claim 2 , wherein each first portion (MA 1 , MB 1 , MC 1 ) on a first side of the equatorial plane (C) and each second portion (MA 2 , MB 2 , MC 2 ) on a second side of the equatorial plane (C) are symmetrical with respect to this same equatorial plane (C).", "abstract": "A tire ( 1 ) having a tread ( 10 ) with from one to three tread pattern elements (MA, MB, LC) distributed over one revolution of a wheel. Each tread pattern element has first and second portions positioned on either side of an equatorial plane (C). Each portion of each tread pattern element has at least one main sipe ( 85 ) having the curvature of said portion, and substantially parallel to its edges, the main sipe ( 85 ) extends continuously from a first axial edge ( 24 G, 24 D) on a first side of the equatorial plane (C) to a connection point ( 90 ) situated in a main void ( 80 ) on a second side of the equatorial plane (C), the main void ( 85 ) extending to a second edge ( 24 G, 24 D) of the tread ( 10 ); the axial width of the main sipe ( 85 ) represents from 52% to 63% of the axial width of the tread ( 10 ).", "source_file": "patents_ipa250220.json"}
{"unit_id": "20240246357::desc::0", "doc_number": "20240246357", "title": "SPOKE REINFORCING METHOD AND REINFORCED STRUCTURE OF SPOKES", "classification": "B60B102FI", "section": "desc", "idx": 0, "text": "FIGS.10˜14disclose the spoke reinforcing method in a preferred embodiment of the present invention. First, a metal material is drawn into an elbow spoke of the required diameter. The metal material includes, but not limited to stainless steel, carbon steel, titanium alloy, aluminum alloy, etc. The spoke production methods include straight-pull spoke and elbow spoke, taking the elbow spoke production method as an example, as shown inFIG.11(B), the procedure includes straightening and cutoff (001), the drawn spoke (1) is straightened and cut to the required length; first forging (002), one end of the spoke (1) is stamped by a first stamping unit to form the initial head (2) and neck (3); clamp forming (003), the head (2), neck (3) and main body of spoke (1) of the initial formed spoke (1) are clamped by a clamping die, the shape forging of the reinforced part (4) is completed during clamping, a hexagonal column is taken as an example in this embodiment (including, but not limited to triangular prism, quadrangular prism or arbitrary polygonal column); second forging (004), the spoke (1) clamped by the clamping die is stamped by a second stamping unit, so as to form the final head (2), neck (3) and reinforced part (4); bending (005), the neck (3) of the formed spoke (1) is bent; hobbing (006), the end opposite to the head (2) of said spoke (1) is hobbed to form a thread part (5), thus reinforced structure of spokes is completed, as shown inFIG.10.", "abstract": "The present invention relates generally to a spoke reinforcing method and reinforced structure of spokes, the method includes a main body of spoke with a head end and a thread part on two ends respectively, a neck is disposed below the head end, the neck is forged at least twice to enlarge the cross-section area of the neck, and to increase the density and strength of the metal grains therein; a hexagonal columnar reinforced structure is forged below this high density neck, and the high frequency lateral stress on the lower part of the high density neck is buffered by the optimal compressive strength and flexural strength of the hexagonal column, the reinforced structure of spokes produced by this method can reduce the spoke fracture probability and prolong the spoke lifetime.", "source_file": "patents_ipa240725.json"}
{"unit_id": "20240286436::desc::4", "doc_number": "20240286436", "title": "Tire With RFID Enclosed In Different Rubber Layers And Related Methods", "classification": "B60C100FI", "section": "desc", "idx": 4, "text": "In a second embodiment, a process is provided for curing a tire with an electronic communication module. According to the process of the second embodiment, an uncured tire carcass and an electronic communication module including an enclosed radio device positioned between a first rubber layer and a second rubber layer are provided. The first rubber layer is comprised of 100 parts of at least one diene-based rubber, at least one filler, and a cure package and the first rubber layer has a T50 cure time T50-1 at 160° C. of about 1.5 to about 3.5 minutes, preferably about 2 to about 3 minutes. The second rubber layer is comprised of at least one diene-based rubber, at least one filler, and a cure package, and the second rubber layer has a T50 cure time T50-2 at 160° C. that is greater than T50-1 and is about 2.5 to about 5 minutes, preferably about 3 to about 4 minutes. According to the second embodiment, the first and second rubber layers each independently have a thickness of about 0.4 to about 3 mm, preferably about 0.5 to about 2 mm. Further according to the process of the second embodiment, the enclosed radio device (i.e., the radio device that is positioned between the first and second rubber layers) is positioned against at least one component of the uncured tire carcass, and then the uncured tire carcass is cured together with the enclosed radio device.", "abstract": "Disclosed herein is a tire having an electronic communication module including a radio device where the radio device is positioned between a first rubber layer and a second rubber layer, with the second rubber layer having a T50 cure time at 160° C. that is than the T50 cure time of the first rubber layer. Also disclosed are related methods for curing a tire with an electronic communication module including a radio device positioned between a first rubber layer and a second rubber layer, with the second rubber layer having a T50 cure time at 160° C. that is than the T50 cure time of the first rubber layer.", "source_file": "patents_ipa240829.json"}
{"unit_id": "20250135804::desc::480", "doc_number": "20250135804", "title": "WHEEL ASSEMBLY INCLUDING OUTER METALLIC LAYER TREAD ASSEMBLY AND RELATED METHODS", "classification": "B60C706FI", "section": "desc", "idx": 480, "text": "Referring now toFIG.92, in another embodiment the tread assembly1470″′″ described above with respect toFIG.91, includes a metallic tread support1471″′″ carrying the inner resilient material layer1472″′″ and the outer metallic layer1473″′″. Protrusions1476″′″ extend radially outwardly from the metallic tread support1471″′″. The protrusions1476″′″ are illustratively in the form of spikes, for example. The protrusions1476″′″ may be considered or may be in the form of studs or ribs, for example. The protrusions1476″′″ may include more than one type or shape of protrusion. Similarly to the embodiment described above, the protrusions1476″′″ engage, and may operate to secure, the inner resilient material layer1472″′″ to the metallic tread support1471″′″.", "abstract": "A wheel assembly may include an inner rim and an outer rim surrounding the inner rim. The wheel assembly may also include gas springs coupled between the inner and outer rims, and a tread assembly carried by the outer rim. The tread assembly may include an inner resilient material layer carried by an outer circumferential surface of the outer rim, and an outer metallic layer carried by the inner resilient material layer to rotatably contact a ground surface as the wheel assembly moves along a path of travel.", "source_file": "patents_ipa250501.json"}
{"unit_id": "20250108668::desc::102", "doc_number": "20250108668", "title": "TIRE WITH ATTACHED COMPONENT AND SENSOR CONTAINER ASSEMBLY", "classification": "B60C2304FI", "section": "desc", "idx": 102, "text": "FIG.4shows another schematic cross-section of a sensor container20′, in accordance with another embodiment of the present invention. In particular, the sensor container20′ comprises an attachment surface25′ including prism-shaped ribs22′. The ribs22′ include an elongated shape extending in the direction1.", "abstract": "In one aspect, the invention is directed to a tire including an inner surface comprising an elastomer composition and partially enclosing a tire cavity. The tire further comprises a component including an attachment surface comprising a polymer composition, which is attached to a portion of the inner surface via an adhesive, wherein the attachment surface comprises a surface pattern comprising elevations including a height within a range of 20 μm to 1000 μm. In a second aspect, the invention is directed to a method of attaching a component to a portion of an inner surface of a tire. Furthermore, the invention is directed to a sensor container assembly comprising a sensor container and a tire pressure sensor.", "source_file": "patents_ipa250403.json"}
{"unit_id": "20240239141::desc::118", "doc_number": "20240239141", "title": "SOUNDPROOF TYRE FOR VEHICLE WHEELS", "classification": "B60C1900FI", "section": "desc", "idx": 118, "text": "The reference numeral100indicates inFIG.1a tyre for vehicle wheels, which generally comprises a carcass structure101having respectively opposite end flaps engaged with respective annular anchoring structures102, called bead cores, possibly associated with a bead filler104. The tyre area comprising the bead core102and the filler104forms a bead structure103intended for anchoring the tyre onto a corresponding mounting rim, not shown. Each bead structure103is associated to the carcass structure by folding back of the opposite lateral edges of the at least one carcass layer101around the bead core102so as to form the so-called carcass flaps101aas shown inFIG.1.", "abstract": "The present invention relates to a soundproof tyre for vehicle wheels comprising a noise reducing element made by vulcanising a vulcanisable and expandable elastomeric compound comprising at least one elastomeric polymer, at least one expanding agent, and at least one compound selected from the group of (i) fatty acid amides and (ii) polymers and copolymers of caprolactone, lactic acid, glycolic acid, and mixtures thereof.", "source_file": "patents_ipa240718.json"}
{"unit_id": "20240092127::desc::40", "doc_number": "20240092127", "title": "PROGRAMMING METHOD AND DEVICE BASED ON TIRE PRESSURE SENSING", "classification": "B60C2304FI", "section": "desc", "idx": 40, "text": "As shown inFIG.3, an embodiment of the present application provides a programming device based on tire pressure sensing, which includes:a region identification sending module301, used to transmit a region identification including at least one of a country, a region and a customer to an intelligent terminal through near-field communication for requesting the intelligent terminal to automatically match a database with the region identification, and return a manufacturer code corresponding to a preset vehicle model identification from the database;a manufacturer code receiving module302, used to receive the manufacturer code sent by the intelligent terminal through near-field communication; anda programming module303, used to program the tire pressure sensing device based on the manufacturer code.", "abstract": "The present application provides a programming method and a programming device based on tire pressure sensing, which is related to the technical field of pressure sensing. The programming method includes: transmitting a region identification including at least one of a country, a region and a customer to an intelligent terminal through near-field communication for requesting the intelligent terminal to automatically match a database with the region identification and return a manufacturer code corresponding to a preset vehicle model identification from the database; receiving the manufacturer code sent by the intelligent terminal through near-field communication; and programming the tire pressure sensing device based on the manufacturer code. The programming method avoids an operator frequently manually switching countries, regions and customers on the intelligent terminal to match with the database, and also avoids a situation that the tire pressure sensing device cannot work normally due to error of manual switching.", "source_file": "patents_ipa240321.json"}
{"unit_id": "20240326512::desc::92", "doc_number": "20240326512", "title": "OMNIDIRECTIONAL ROLLER WHEEL WITH SOLID BUSHING AND SYMMETRICAL AXLE", "classification": "B60B1900FI", "section": "desc", "idx": 92, "text": "Similarly, a single mold may have a portion accepting inserts that form, accommodate, or mask features desired to be varied among wheel designs. Thus, one mold may be configured to accept an insert allowing the pre-roller assemblies to seat and having suitable shut-off regions and overmolding volume for molding the wheel hub. The underlying mold may, when such an insert is removed, include seating, shut-off regions, and overmolding volumes suitable for overmolding the peripheral rollers. The configurations shown inFIG.6A-FIG.6Dare intended to illustrate exemplary molds for use in the disclosed methods, but other configurations will immediately present themselves to one of ordinary skill in the art.", "abstract": "A wheel and a method for its manufacture are disclosed herein. The wheel includes a wheel hub including a main axle bore rotatable around a main axis. The wheel also includes a plurality of cross roller sub-assemblies comprising a plurality of pre-roller assemblies. The pre-roller assemblies include a plurality of symmetrical axles, and a plurality of axle bushings, each axle bushing configured to receive one symmetrical axle in a central longitudinal bore. The cross roller sub-assemblies also include a plurality of peripheral rollers, each pre-roller assembly overmolded with one peripheral roller. The wheel also includes a peripheral axle ring adapted about the wheel and radially spaced from the main axis, the wheel having the plurality of cross roller sub-assemblies overmolded with the wheel hub, where the overmolded cross roller sub-assemblies form the peripheral axle ring.", "source_file": "patents_ipa241003.json"}
{"unit_id": "20240278599::desc::86", "doc_number": "20240278599", "title": "CASTER ASSEMBLIES HAVING CAM-OPERATED BRAKES", "classification": "B60B3302FI", "section": "desc", "idx": 86, "text": "In some examples, the transport dolly100can support the weight W of the engine902on the inclined surface20and remain stationary due to engagement of two of the caster assemblies200(e.g., the second and fourth caster assemblies804B,804D). In some examples, an angle22of the ground surface10is fifteen degrees. In other examples, the angle22is greater than fifteen degrees. In such examples, the transport dolly100is capable of remaining stationary and supporting the weight W up to a first threshold angle (e.g., 20 degrees, 25 degrees, etc.) with two of the caster assemblies200in the engaged position600and two of the caster assemblies200in the released position700. In some examples, the transport dolly100is capable of remaining stationary and supporting the weight W up to a second threshold angle (e.g., 30 degrees, 45 degrees, etc.) greater than the first threshold angle when all (e.g., all four) of the caster assemblies200are in the engaged position600.", "abstract": "Caster assemblies are disclosed herein. An example caster assembly includes a caster frame assembly including a caster frame, a caster mounting plate, and a brake arm; a pin having a first end and a second end opposite the first end, the second end to engage the brake arm; and a lever arm having a third end and a fourth end opposite the third end, the lever arm to pivot relative to the caster frame assembly between a first position and a second position, movement of the lever arm to the first position to cause the fourth end of the lever arm to actuate the pin in a first direction to move the brake arm to the engaged position to restrict rotation of the wheel.", "source_file": "patents_ipa240822.json"}
{"unit_id": "20240278599::desc::114", "doc_number": "20240278599", "title": "CASTER ASSEMBLIES HAVING CAM-OPERATED BRAKES", "classification": "B60B3302FI", "section": "desc", "idx": 114, "text": "Example 11 includes a transport dolly comprising a dolly frame, and a plurality of caster assemblies, the caster assemblies each including a wheel, a caster frame assembly including a caster frame and a brake arm, the wheel coupled to the caster frame, the brake arm rotatably coupled to the caster frame, the brake arm to rotate between an engaged position and a released position, the brake arm to engage the wheel when in the engaged position to restrict rotation of the wheel relative to the caster frame, the brake arm to disengage the wheel when in the released position to enable rotation of the wheel relative to the caster frame, a pin having a first end extending at least partially through the dolly frame and a second end opposite the first end extending at least partially through the caster frame, and a lever arm rotatably coupled to the dolly frame, the lever arm including a handle and a cam, the lever arm to move the brake arm between an engaged position to restrict rotation of the wheel relative to the dolly frame and a released position to enable rotation of the wheel relative to the dolly frame via the cam and the pin when the lever arm is rotated relative to the dolly frame.", "abstract": "Caster assemblies are disclosed herein. An example caster assembly includes a caster frame assembly including a caster frame, a caster mounting plate, and a brake arm; a pin having a first end and a second end opposite the first end, the second end to engage the brake arm; and a lever arm having a third end and a fourth end opposite the third end, the lever arm to pivot relative to the caster frame assembly between a first position and a second position, movement of the lever arm to the first position to cause the fourth end of the lever arm to actuate the pin in a first direction to move the brake arm to the engaged position to restrict rotation of the wheel.", "source_file": "patents_ipa240822.json"}
{"unit_id": "20240253393::desc::64", "doc_number": "20240253393", "title": "HUB FOR HUMAN-POWERED VEHICLE", "classification": "B60B2702FI", "section": "desc", "idx": 64, "text": "In a case where the rider starts to pedal after coasting, the frictional force between the slider53and the second ratchet member52becomes smaller. Thus, in this case, since the frictional force between the slider53and the second ratchet member52is reduced, the force with which the second helical spline66is pressed against the first helical spline34bis reduced. The second ratchet member52approaches the first ratchet member51due to the spring force of the biasing member54. Even in this case, the rotational force of the slider53is transmitted from the first rotating body32. That is, the rotational force of the slider53is transmitted from the second circumferentially-facing surfaces32e1of the first rotating body32to the first circumferentially-facing surfaces82aof the slider53. Due to the inclined surface of the circumferentially-facing surface32e1of the first rotating body32, the slider53moves in the first axial direction A1and rotates in the non-driving rotational direction D2respect to the first rotating body32as the first ratchet teeth60and the second ratchet teeth64are changed from disengaged (FIG.13) to engaged (FIG.12). After that, when the second ratchet teeth64engage with the first ratchet teeth60, the rotational force of the slider53is transmitted from the second ratchet member52.", "abstract": "A hub is provided for a human-powered vehicle. The hub includes a hub axle, a first rotating body, a second rotating body, a first ratchet member, a second ratchet member and a slider. The first rotating body and the second rotating body are rotatably mounted on the hub axle. The first ratchet member rotates with the first rotating body. The second ratchet member rotates with the second rotating body. The slider rotates with the first rotating body and slide with respect to the second rotating body in a circumferential direction. The slider has a first contact surface in sliding contact with an axially facing surface of the second ratchet member. The slider has a second contact surface in sliding contact with a radially facing surface of the second ratchet member.", "source_file": "patents_ipa240801.json"}
{"unit_id": "20250065668::claim::3", "doc_number": "20250065668", "title": "DECORATIVE SECURITY WHEEL FASTENER", "classification": "B60B316FI", "section": "claim", "idx": 3, "text": "4 . The security fastener assembly of claim 1 , further comprising the corresponding security tool having a cavity to receive the cap and flange of the fastener body and having a corresponding keyed security element to engage the keyed security drive feature on the fastener body.", "abstract": "A security fastener assembly is provided with a cap having a decorative bearing surface and a lower retention portion. A fastener body has: a threaded portion or securing the fastener assembly to a corresponding threaded feature on a vehicle; a stem opposite the threaded portion for receiving the cap, the stem having a security protrusion defining a distal end, an undercut formed adjacent the stem for cooperating with the lower retention portion of the cap, where the lower retention portion of the cap is secured in the undercut to maintain the cap on the fastener body; a keyed security drive feature formed between the threaded portion the stem portion where the fastener body is removable with the keyed security feature. Engaging the decorative bearing surface of the cap and rotating does not rotate the threaded portion of the fastener body.", "source_file": "patents_ipa250227.json"}
{"unit_id": "20240399796::desc::26", "doc_number": "20240399796", "title": "THREE-DIMENSIONAL TIRE SIPE", "classification": "B60C1112FI", "section": "desc", "idx": 26, "text": "Sipe blade100may be difficult to draw out of a tire after molding and curing (tire mold extraction). This results from the amount of surface area of the sipe blade at its distal portion (the radially inner three-dimensional portion102).", "abstract": "Various embodiments of a tire having a three-dimensional tire sipe are disclosed. In one embodiment, a tire having a sipe is provided, the tire comprising: opposing tread element portions separated by the sipe, each opposing tread element portion including a plurality of positive elements and a plurality of negative elements, wherein the plurality of positive elements and the plurality of negative elements include three substantially quadrilateral-shaped planar surfaces, each planar surface being oriented relative to another planar surface by an angle of 90 degrees, wherein the three planar surfaces meet at a rounded terminal portion, wherein the sipe includes a radially outer zig-zag portion, wherein the sipe includes a radially inner three-dimensional portion radially inward of the radially outer zig-zag portion, and wherein the sipe includes a radially inner zig-zag portion radially inward of the radially inner three-dimensional portion.", "source_file": "patents_ipa241205.json"}
{"unit_id": "20240408912::desc::132", "doc_number": "20240408912", "title": "ASSEMBLY FOR VEHICLE DRIVING DEVICE", "classification": "B60B2700FI", "section": "desc", "idx": 132, "text": "For example, the predetermined first inclination angle may be an angle greater than 90 degrees and may be smaller than the predetermined second inclination angle.", "abstract": "An assembly for a vehicle driving device includes a hub configured to rotate about a rotary axis and one or more first fastening members configured to couple the hub and a rim of a wheel for a vehicle, wherein one end portion of the hub includes a first facing surface facing one surface of the rim, wherein the first facing surface includes a portion having an inclination angle with respect to the rotary axis, and the first fastening member is inserted into one portion of the one surface of the rim facing the portion having the inclination angle of the first facing surface and the portion having the inclination angle of the first facing surface in a perpendicular direction to couple the hub and the rim.", "source_file": "patents_ipa241212.json"}
{"unit_id": "20250121634::claim::3", "doc_number": "20250121634", "title": "PNEUMATIC TIRE", "classification": "B60C1900FI", "section": "claim", "idx": 3, "text": "4 . The pneumatic tire according to claim 1 , wherein each of the plurality of Helmholtz sound absorbers is formed of a resin having a shape that does not change at 120° C. or lower.", "abstract": "A pneumatic tire can include a plurality of Helmholtz sound absorbers on a tire inner cavity surface. The plurality of Helmholtz sound absorbers can have a first resonance frequency as a maximum resonance frequency and a second resonance frequency as a minimum resonance frequency. A difference between the first resonance frequency and the second resonance frequency can be 10 to 90 Hz.", "source_file": "patents_ipa250417.json"}
{"unit_id": "20240391280::claim::15", "doc_number": "20240391280", "title": "TOOL FOR USE WITH TIRE ASSEMBLIES", "classification": "B60C2502FI", "section": "claim", "idx": 15, "text": "16 . The method of claim 15 , wherein the engaging the tire assembly located on the surface comprises rotating the tire tool to the engagement state; and positioning the platform under the tire assembly.", "abstract": "A tire tool, and method of using, that can be used to manipulate tires by a user. The tire tool has a platform that can engage under a tire assembly, a front section, and a rear section. The tire tool can rotate between an engagement position and a pivoted position about a pivot. When in the pivoted position, a stop abuts the surface. The tire tool can be used by a user to lift a tire assembly off the ground, remove the tire assembly from an hub, and install the tire assembly on a hub.", "source_file": "patents_ipa241128.json"}
{"unit_id": "20240336096::desc::66", "doc_number": "20240336096", "title": "TRAILER TOWING APPARATUS", "classification": "B60D1167FI", "section": "desc", "idx": 66, "text": "The trailer coupling1bis connected to a housing600via a pin71. The pin71provides the roll pivot. The housing600is joined to another housing175via another pin200, which pin provides the pitch pivot. A bar3is connected to the housing175via another pin2and can be constrained from rotating about the pin2by a latch4. The pin2, the bar3and the latch4(shown latched inFIG.16and unlatched inFIG.18) together constitute the switchable yaw pivot, with the switching being done via a handle5. In this respect, pulling on the handle5unlatches the latch4via a cable500or other suitable link, thereby allowing the bar3to rotate relative to the housing175.", "abstract": "Apparatus for connecting a trailer 20 to a vehicle for towing. The apparatus comprises: a vehicle-trailer coupling including a vehicle coupling 1 a and a trailer coupling 1 b and having a vertical centreline X; and a switchable yaw pivot 2 . The switchable yaw pivot 2 is switchable between locked and unlocked positions. In the unlocked position movement of one part 3 of the apparatus relative to a remaining part of the apparatus about the switchable yaw pivot 2 is permitted in order to align the vehicle coupling 1 a with the trailer coupling 1 b to assist with coupling. In the locked position movement about the switchable yaw pivot 2 is not permitted after coupling and once the vehicle and trailer are aligned. When the switchable yaw pivot is locked, relative yaw movement between the vehicle and the trailer is only possible about the virtual yaw pivot Y.", "source_file": "patents_ipa241010.json"}
{"unit_id": "20250058583::desc::128", "doc_number": "20250058583", "title": "WHEEL ASSEMBLY INCLUDING HOLLOW PISTON SHAFT ORIFICE AND RELATED METHODS", "classification": "B60B924FI", "section": "desc", "idx": 128, "text": "Similar to the embodiments described above, as will be appreciated by those skilled in the art, the gas springs350′ provide a gas suspension for relative movement between the inner rim331′ and the outer rim333′. The gas springs350′ have an operating stroke the permits the outer ring340a′ to define a mechanical stop. In other words, the gas springs350′ maintain the outer rim333′ spaced apart from the inner rim331′. However, if pressure on any gas spring350′ causes the gas spring to reach its limit under load or the gas spring fails, the outer ring340a′ may act as a mechanical stop to limit relative movement between the inner and outer rims331′,333′. In other words, the outer ring340a′ and gas springs350′ may be considered as providing a run-flat capability. Since the gas springs350′ are similar to the gas springs described with respect to the embodiments above, further details of the gas springs need not be described.", "abstract": "A wheel assembly for a vehicle may include an inner rim to be coupled to the vehicle, and an outer rim surrounding the inner rim. The wheel assembly may also include gas springs operatively coupled between the inner rim and the outer rim to provide relative movement between the inner rim and the outer rim. Each of the gas springs may include a gas cylinder body, and a gas piston including a hollow piston shaft and an enlarged piston head coupled thereto. The enlarged piston head may be slideably moveable within the gas cylinder body and define first and second gas cylinder chambers on opposing first and second sides of the enlarged piston head. The enlarged piston head may have an orifice therethrough permitting gas flow between the first gas cylinder chamber and the hollow piston shaft.", "source_file": "patents_ipa250220.json"}
{"unit_id": "20240092126::claim::0", "doc_number": "20240092126", "title": "Tire Tread for a Heavy Vehicle with Improve Resistance to Aggressive Effects", "classification": "B60C1112FI", "section": "claim", "idx": 0, "text": "the tread in the new state comprising at least one complex cut comprising, along a mean line (Lm), an alternation of external cavities, opening onto the tread surface, and internal cavities, not opening onto the tread surface, two consecutive cavities, respectively an external cavity and an internal cavity, being connected to each other by a connecting channel, each external cavity having, in a mean surface (Sm) containing the mean line (Lm) and a radial direction (ZZ′) perpendicular to the tread surface, a height (H each internal cavity having, in the mean surface (Sm), a height (H each connecting channel having, in the mean surface (Sm), a height (H each complex cut having, in the mean surface (Sm), a height (H), measured, in the radial direction (ZZ′), between the tread surface and the internal cavity bottom, the height (H wherein the height (H", "abstract": "A tire tread ( 1 ) for a heavy-duty vehicle to improve resistance to attack by stones. The tread ( 1 ) in the new state having at least one complex cut ( 5 ) with, along a mean line (Lm), an alternation of external cavities ( 6 ), opening onto the tread surface ( 2 ), and internal cavities ( 7 ), not opening onto the tread surface ( 2 ), two consecutive cavities, respectively an external cavity ( 6 ) and an internal cavity ( 7 ), being connected to each other by a connecting channel ( 8 ) of non-zero length, the height (H 11 ) of each external cavity ( 6 ) being at least equal to half the height (H) of the complex cut ( 5 ), the height (H 3 ) of each connecting channel ( 8 ) being at most equal to one third of the height (H) of the complex cut ( 5 ).", "source_file": "patents_ipa240321.json"}
{"unit_id": "20240424835::claim::5", "doc_number": "20240424835", "title": "PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES", "classification": "B60C1103FI", "section": "claim", "idx": 5, "text": "6 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "abstract": "A pneumatic radial tire for passenger vehicles that satisfies a defined relationship between sectional width SW and outer diameter OD of the tire and includes one or more circumferential main grooves extending in a tire circumferential direction on a tread contact surface. A negative ratio of a half portion of the tire on a vehicle-mounted outward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted inward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary. A drop height (or ground contact length relationship, or tread gauge relationship) is also defined.", "source_file": "patents_ipa241226.json"}
{"unit_id": "20240278595::desc::20", "doc_number": "20240278595", "title": "FACE TO RIM REINFORCING CONNECTOR OF A COMPOSITE WHEEL", "classification": "B60B310FI", "section": "desc", "idx": 20, "text": "As shown inFIGS.3A,3B and3C, each spoke saddle310is located at and over or within the fibre layup of end section150of the spoke108located at the connection region110between the rim portion102and spoke portion108of the composite wheel100. Each spoke saddle310can be located over all of the layers of the fibre layup of end section150or may be incorporated under one or more layers within the fibre layup of end section150of the spoke108. In most cases, the spoke saddle310is located as close to the top layer of the fibre layup as practical. The connector300is therefore located at the outboard end of the fibre layup of the spoke108where the load transfer between the rim and face structures are required. The spoke to rim reinforcing connector300has a continuous configuration position on and within the fibre layup of the connection region110that starts in the inner surface140of rim portion102(the first rim tab320), wraps around the face surface130of the spoke108(the spoke saddle310), and ends back in the inner surface140of the rim portion102(the second rim tab320). As shown inFIGS.3B and3C, the spoke saddle310is integrated into the fibre layup of the end portion150of spoke108.", "abstract": "A spoke-to-rim reinforcing connector of a composite wheel. The composite wheel has a rim portion with a complementary rim fibre layup and a circumferential axis, and a face portion with a hub and spokes interconnecting the rim portion and the hub, each spoke having a complementary spoke fibre layup. The spoke-to-rim reinforcing connector comprises at least one spoke saddle and at least two rim tabs. The spoke saddle has a seat portion extending around an end portion, about the spoke axis, and over a face surface of the spoke fibre layup, and at least two spoke legs that extend over the sides of the spoke fibre layup. Each rim tab extends from a spoke leg perpendicularly to the spoke axis and is configured to be incorporated into the rim fibre layup. The connector has a continuous body having a fibre orientation extending perpendicular to the spoke axis.", "source_file": "patents_ipa240822.json"}
{"unit_id": "20240051333::claim::5", "doc_number": "20240051333", "title": "SPOKE", "classification": "B60B104FI", "section": "claim", "idx": 5, "text": "6 . The spoke according to claim 5 , wherein a material of the connecting element comprises epoxy, PEEK, PAEK or PEKK.", "abstract": "A spoke includes an axle body and two connecting elements. The axle body has a middle segment and two connecting segments. The two connecting segments are respectively connected to two opposite sides of the middle segment. The two connecting segments each have a first peripheral surface, and the two first peripheral surfaces each are formed with a friction enhancing structure. The two connecting elements respectively wrap at least a part of the two friction enhancing structures by means of injection molding. The two connecting elements each have a second peripheral surface facing away from the axle body, and the two second peripheral surfaces each are formed with a connecting structure.", "source_file": "patents_ipa240215.json"}
{"unit_id": "20250058588::desc::320", "doc_number": "20250058588", "title": "CAR TYRE", "classification": "B60C1103FI", "section": "desc", "idx": 320, "text": "Preferably, the third sipes23are substantially parallel to the third transverse grooves12.", "abstract": "Car tyre ( 100 ) having a tread band ( 7 ) comprising a central region (L 1 ) and two shoulder regions (L 2 , L 3 ); the central region (L 1 ) having a plurality of ribs ( 8, 9, 10 ), wherein a first rib ( 8 ) with a plurality of first transverse grooves ( 15 ) comprising a substantially straight first segment ( 15 ′), inclined relative to a direction parallel to said equatorial plane (X-X) so as to form an angle Θ smaller than or equal to 70°, a substantially straight counter-inclined second segment ( 15 ″) and a curved connecting segment ( 15 ″′) extending between said first segment ( 15 ′) and said second segment ( 15 ″); —the first rib ( 8 ) further comprising first straight sipes ( 21 ) located in the first rib ( 8 ) between said first transverse grooves ( 15 ) and extending over at least 60% of the width of said first rib ( 8 ); the first sipes ( 21 ) forming with said equatorial plane (X-X) an angle Θ′ preferably equal to the angle Θ of the first segment ( 15 ′) of the first transverse grooves ( 15 ).", "source_file": "patents_ipa250220.json"}
{"unit_id": "20240092121::desc::12", "doc_number": "20240092121", "title": "BASSINET", "classification": "B60B3300FI", "section": "desc", "idx": 12, "text": "The height adjuster252is shown inFIG.9as fixedly connected to a rotary gear260, such that they are rotationally locked together, e.g., by threaded members. The rotary gear260has a predefined range of rotary movement defined by a toothed region262(seeFIG.12). In the embodiment shown, the rotary gear260has a maximum range of motion of ±135° from a nominal (i.e. “0°”) position. The column assembly200is secured to the base by collar280, which is attached to the base100(e.g., at hole120, seeFIG.3) in the form of a sandwich member, having a two-piece construction with a first piece positioned below the base100and a second piece positioned above the base100. Collar280may be in the form of a rotary bearing for smooth rotary movements of the column assembly200relative to the base100. In some embodiments, a bearing may be provided separately from the collar280. Safety collar280is provided at the bottom of column assembly200and is rotationally locked to move with the other components of the column assembly200.", "abstract": "A bassinet includes a base, a column assembly rotatably connected to the base at a first end of the column assembly, an arm rotatably connected to a second end of the column assembly, a tub frame pivotably connected to the arm, an infant tub retained within the tub frame, the infant tub including a front wall, a back wall, and two side walls and having areas of reduced height along the front wall and at least one of the side walls to provide enhanced access to the infant located within the infant tub, and an insert configured to reversibly fit within an interior of the infant tub.", "source_file": "patents_ipa240321.json"}
{"unit_id": "20240351377::desc::140", "doc_number": "20240351377", "title": "TIRE", "classification": "B60C1302FI", "section": "desc", "idx": 140, "text": "In each of the embodiments in the present description, in a case in which the tire1is configured as a truck/bus pneumatic tire (FIG.6), the tire radial center10mof the communication device10(more preferably, the entire communication device10) is preferably farther outward in the tire radial direction than the tire radial outer end of the bead core4a.This can improve the communication performance and lengthen the communication distance between the communication device10and the aforementioned predetermined external device.", "abstract": "A tire 1 includes a communication device 10 embedded inside a tire side portion 1 d and a plurality of turbulence-generating projections F projecting from a tire outer surface 1 ds of the tire side portion, extending along the tire radial direction, and arranged at intervals in the tire circumferential direction. The communication device overlaps at least one of an inter-projection recess G between adjacent turbulence-generating projections and the turbulence-generating projection F in a projected plane of the tire side portion in the tire width direction.", "source_file": "patents_ipa241024.json"}
{"unit_id": "20240375437::claim::7", "doc_number": "20240375437", "title": "RECOVERY BOARD WITH INNER VALLEY", "classification": "B60B3900FI", "section": "claim", "idx": 7, "text": "8 . The recovery board of claim 2 , wherein the gripping features of the exterior gripping features and the interior gripping features proximate the leading edge comprises an inclined ramp oriented such that a lower end is proximate the leading edge and a raised end is a distance from the leading edge.", "abstract": "A recovery board for providing traction to a tire or track on a vehicle includes a main body having a leading edge and a trailing edge along a direction of travel wherein a distance between the leading edge and the trailing edge defines a length of the main body. The main body includes a top surface configured to engage the wheel or track of the vehicle having spaced apart rows of exterior gripping features and an interior row of gripping features between the spaced apart rows of exterior gripping features. Upper surfaces of the spaced apart rows of exterior gripping features are at a higher elevation relative to upper surfaces of the interior row of gripping features in a direction transverse to a direction of travel along the length of the main body such that an interior valley is formed between the spaced apart rows of exterior gripping features.", "source_file": "patents_ipa241114.json"}
{"unit_id": "20250135804::desc::366", "doc_number": "20250135804", "title": "WHEEL ASSEMBLY INCLUDING OUTER METALLIC LAYER TREAD ASSEMBLY AND RELATED METHODS", "classification": "B60C706FI", "section": "desc", "idx": 366, "text": "First and second gas charge fittings1261are carried by the gas cylinder body1251and coupled to respective one of the first and second gas cylinder chambers1255a,1255b. The gas charge fittings1261may be used to charge the respective gas cylinder chambers1255a,1255bto a desired pressure, for example, in the range of 500-1000 psi.", "abstract": "A wheel assembly may include an inner rim and an outer rim surrounding the inner rim. The wheel assembly may also include gas springs coupled between the inner and outer rims, and a tread assembly carried by the outer rim. The tread assembly may include an inner resilient material layer carried by an outer circumferential surface of the outer rim, and an outer metallic layer carried by the inner resilient material layer to rotatably contact a ground surface as the wheel assembly moves along a path of travel.", "source_file": "patents_ipa250501.json"}
{"unit_id": "20240278604::claim::9", "doc_number": "20240278604", "title": "TIRE", "classification": "B60C1900FI", "section": "claim", "idx": 9, "text": "10 . The tire according to claim 3 , wherein the communication device has an RF tag.", "abstract": "Tire 1 is a tire that includes a marking portion 20 disposed on a tire outer surface 1 ds of a tire side portion 1 d and a communication device 10 , wherein the marking portion has one or more markings 21 , each of the one or more markings 21 forms a letter, a symbol, or a graphic and is formed into a convex shape, and at least a part of the communication device is embedded within at least one of the one or more markings 21.", "source_file": "patents_ipa240822.json"}
{"unit_id": "20250091385::desc::54", "doc_number": "20250091385", "title": "MOVING DEVICE", "classification": "B60B2110FI", "section": "desc", "idx": 54, "text": "The second limiting structure621includes a plurality of protruding portions arranged on an inner circumferential surface of the tire20. The protruding portions are in one-to-one correspondence with the above axial grooves. As shown inFIG.7toFIG.9, when the tire20is arranged on the rim10in a direction of a hollow arrow inFIG.8, the tire20is connected to the rim10, the protruding portions are clamped into the axial grooves to limit the movement of the tire20relative to the rim10in the circumferential direction of the wheel100. That is, the tire and the rim are detachably connected through a tongue-and-groove engagement mechanism (e.g., a protrusion and a groove).", "abstract": "The present disclosure relates to a moving device, including a body and wheels arranged at a bottom of the body to drive the moving device to move. The wheel includes: a rim; and a tire. The tire is detachably connected to the rim, and includes a first end and a second end detachably butt-joined, such that the tire can be disconnected at the first end and the second end to allow the tire to be detached relative to the rim. When the tire is damaged and needs to be replaced, the tire is disconnected at the first end and the second end so as to be gradually separated from the rim, and thus, a user can replace the tire without detaching any part of the body.", "source_file": "patents_ipa250320.json"}
{"unit_id": "20240391281::desc::32", "doc_number": "20240391281", "title": "HITCH VIBRATION DAMPENER", "classification": "B60D106FI", "section": "desc", "idx": 32, "text": "In some embodiments, the dampener member is detachably affixed. As such, dampener member22,22′,22″,42,42′ may be provided in a kit form or as an after-market component.", "abstract": "A height adjustable tow mount assembly wherein locked engagement of corresponding through holes disposed in a tow mount member and an elongate member compresses a dampener member between an abutting front surface of the hitch platform elongate member and a rear surface of the tow mount member to thereby reduce movement and associated vibration between the hitch platform and tow mount member.", "source_file": "patents_ipa241128.json"}
{"unit_id": "20240092122::desc::18", "doc_number": "20240092122", "title": "ADDITIVES IN RUBBER FORMULATIONS", "classification": "B60C100FI", "section": "desc", "idx": 18, "text": "Desirably, the elastomeric composition further comprises (d) at least one polyalkylene glycol. The polyalkylene glycol may be any polyalkylene glycol. Suitably the polyalkylene glycol may be either polyethylene glycol or polypropylene glycol or a mixture of polyethylene glycol and polypropylene glycol (referred to as PEO/PPO) or a polyalkylene glycol containing a mixture of ethylene oxide repeating units and propylene oxide repeating units (referred to as P-EO-PO). More desirably, the polyalkylene glycol is polyethylene glycol or P-EO-PO. Suitably, the P-EO-PO would have a ratio of >0:<100 to <100: >0 ethylene oxide units to propylene oxide units, for instance 1:99 to 99:1. More preferably the polyalkylene glycol is polyethylene glycol.", "abstract": "The present invention relates to the use of at least one N,N-dimethylamide as an additive in an elastomeric composition for producing a tread band for vehicle wheels, wherein the N,N-dimethylamide has the formula: formula (I), wherein: R is a C 6 -C 12 alkyl group, and R′ and R″ are methyl. A further aspect of the present invention concerns a vulcanised elastomeric material for producing a tread band for vehicle wheels obtained by vulcanising an elastomeric composition comprising (a) at least one elastomeric polymer, (b) at least one reinforcing filler selected among hydroxides, oxides and hydrated oxides, salts and hydrated salts of metals or mixtures thereof and (c) at least one N,N-dimethylamide of formula (I). An additional aspect of the present invention concerns a tread band for vehicle wheels comprising a vulcanised elastomeric material, which vulcanised elastomeric material is obtained by vulcanising an elastomeric composition comprising (a) at least one elastomeric polymer, (b) at least one reinforcing filler selected among hydroxides, oxides and hydrated oxides, salts and hydrated salts of metals or mixtures thereof and (c) at least one N,N-dimethylamide of formula (I). The inventive use and the inventive composition provide effective elastomeric materials particularly suitable for use as treads on vehicle tyres.", "source_file": "patents_ipa240321.json"}
{"unit_id": "20240116315::desc::86", "doc_number": "20240116315", "title": "TIRE WITH MULTIPLE STEEL BELTS AND A REINFORCEMENT LAYER", "classification": "B60C918FI", "section": "desc", "idx": 86, "text": "Although not explicitly illustrated, it should be understood that in an alternative embodiment, a single “mid-step” shoulder layer may be employed in each shoulder of a tire. Such a single “mid-step” shoulder layer would be substantially the same as the shoulder layers170of tire100, but with the dimensions of the upper and lower shoulder layers370,385of tire300.", "abstract": "A tire includes a pair of annular beads, a body ply extending between the pair of annular beads, and at least three steel belt layers disposed above the body ply and extending axially across a portion of the body ply. The tire further includes at least one reinforcement layer disposed above the at least three steel belt layers, a circumferential tread disposed above the at least one reinforcement layer and extending axially across the tire, and a pair of sidewalls extending between each of the pair of annular beads and a pair of shoulders associated with the circumferential tread.", "source_file": "patents_ipa240411.json"}
{"unit_id": "20240109373::desc::274", "doc_number": "20240109373", "title": "PNEUMATIC TIRE", "classification": "B60C1103FI", "section": "desc", "idx": 274, "text": "As in the present embodiment, it is preferable for each first middle block221and each second middle block222to have polygonal shapes on the tread surface1. This makes it easier to arrange the middle blocks220in the middle block row22at equal spacing, compared to a case in which they have non-polygonal shapes, such as circular shapes. This can equalize ground contact pressure during rolling of the tire, and thus, wear resistance performance can be improved.", "abstract": "A pneumatic tire that includes a tread surface 1 including: two or more main grooves 3 ; and a pair of middle block rows 22 , wherein one or more first middle blocks in the plurality of middle blocks each have a middle block inclined side wall surface 223 that faces an outer main groove in the pair of outer main grooves and that gradually inclines inwards in a tire radial direction as the middle block inclined side wall surface extends outwards in the tire width direction, and the middle block inclined side wall surface forms an acute angle θ 223 of 30° to 50° with respect to a normal of the tread surface at an inner end in the tire width direction of the middle block inclined side wall surface.", "source_file": "patents_ipa240404.json"}
